src/cf/Enums/ВариантыВысотыВиджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВариантыВысотыВиджетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСодержимому</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Высокий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОченьВысокий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВариантыВысотыВиджетов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет высоту виджета из варианта высоты.
//
// Параметры:
//  ВариантВысоты - ПеречислениеСсылка.ВариантыВысотыВиджетов - Вариант высоты виджета.
// 
// Возвращаемое значение:
//  Число - Высота виджета указанного варианта.
//
Функция ВысотаВиджета(ВариантВысоты) Экспорт
	
	Если ВариантВысоты = ПоСодержимому Тогда
		
		Возврат 0;
		
	ИначеЕсли ВариантВысоты = Обычный Тогда
		
		Возврат 10;
		
	ИначеЕсли ВариантВысоты = Высокий Тогда
		
		Возврат 24;
		
	ИначеЕсли ВариантВысоты = ОченьВысокий Тогда
		
		Возврат 36;
		
	Иначе
		
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Неизвестный вариант высоты виджета %1.'"),
			ВариантВысоты);
		
	КонецЕсли;
	
КонецФункции

// Определяет высоту диаграммы из варианта высоты.
//
// Параметры:
//  ВариантВысоты - ПеречислениеСсылка.ВариантыВысотыВиджетов - Вариант высоты виджета.
// 
// Возвращаемое значение:
//  Число - Высота диаграммы указанного варианта.
//
Функция ВысотаДиаграммы(ВариантВысоты) Экспорт
	
	Если ВариантВысоты = Обычный Тогда
		
		Возврат 5;
		
	Иначе
		
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Неизвестный вариант высоты диаграммы %1.'"),
			ВариантВысоты);
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
